In [1]:
import pandas as pd

In [15]:
df = pd.DataFrame({'id': [1, 2, 3], 'name': ['Alice', 'Bob', 'Charlie']}).set_index('id')
df.head()

       name
id
1     Alice
2       Bob
3   Charlie

In [17]:
lut = df.reset_index().set_index('name').to_dict()['id']

In [18]:
lut

{'Alice': 1, 'Bob': 2, 'Charlie': 3}

In [19]:
lut['Alice']

1

In [20]:
bf = pd.DataFrame({'name': ['Alice', 'Bob', 'Charlie']})

In [21]:
bf['newcolumn'] = bf['name'].map(lut)

In [22]:
bf.head()

      name  newcolumn
0    Alice          1
1      Bob          2
2  Charlie          3